# Title Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewScheduleExportOptions..::..Title Property
ViewScheduleExportOptions Class See Also
---
Whether or not to export the schedule title. Default is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool Title { get; set; }
```

Visual Basic
---
```text
Public Property Title As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Title {
	bool get ();
	void set (bool value);
}
```

# See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace